nebisman/UNDCMotor_julia/motor_firmware/esp32_unmotor/definitions.h
// These parameters allow configuring the different user's commands
float low_val =    0;
float high_val =   0;
uint32_t points_stairs;
uint32_t duration;
uint32_t points_high = 50;
uint32_t points_low = 50;
uint32_t np = 0;
uint32_t total_time = 4294967295;
uint16_t divider = 1;



// Parameters of a general controller for the thermal system
uint8_t order;
float A [MAX_ORDER][MAX_ORDER] = {0};   // Controller's A matrix
float B [MAX_ORDER][2] = {0};    // Controller's B matrix
float C [MAX_ORDER] = {0};       // Controller's C matrix
float D [2] = {0};        // Controller's D matrix
float L [MAX_ORDER] = {0};       // L is the gain matrix for the antiwindup observer



// Vectors of values and times for storing  the edges of
// an user's defined arbitrary signal
float stairs[50];       //  Arbitrary signal
uint32_t timeValues[50];


//Integer code of the command sent by the user
unsigned int codeTopic = DEFAULT_TOPIC;

//Integer code of mode of control, which can be PID (default) or general control
uint8_t typeControl = PID_CONTROLLER;





// These miscellaneous functions allow to receive formatted data (for instance controllers) from user's app
float hex2Float(const char* string){
    // This function converts a 4-digit hexadecimal string received from MQTT to a floating-point number.
    // It enables the reception of precise float numbers without rounding, minimizing the transmitted byte count.
    unsigned long temp;
    sscanf(string, "%8x", &temp);
    float f = *(float *)&temp;
    return f;
}

float hex2Long(const char* string){
    // This function converts a 4-digit hexadecimal string received from MQTT to a long integer.
    // As a result, it enables the reception of precise integer numbers with the minimum byte usage.
    long l = strtol(string, NULL, 16);
    return l;
}

char * float2Hex(float number){
    // This function converts a floating-point number to a 4-digit hexadecimal string. Consequently,
    // it enables the transmission of an exact float number with the minimum byte usage through MQTT.
    static char str[9];
    unsigned long ui;
    memcpy(&ui, &number, sizeof (ui));
    sprintf(str, "%08x", ui);
    return str;
}


char * long2Hex(unsigned long number){
    // This function converts a long integer number to a 4-digit hexadecimal string. Consequently,
    // it enables the transmission of a big number with the minimum byte usage through MQTT.
    static char str[9];
    unsigned long ui;
    memcpy(&ui, &number, sizeof (ui));
    sprintf(str, "%08x", ui);
    return str;
}

void hexStringToFloatArray(float* floatArray, const char* hexString, unsigned int numFloats) {
    // This function translates a user-sent hexadecimal string into an array of floats, enabling the transmission
    // of arbitrary signals and parameters of a controller in a state space form.
    for (uint i = 0; i < numFloats; ++i) {
        unsigned long temp;
        sscanf(hexString + i * 8, "%8x", &temp); // Read 8 hex digits (32 bits)
        memcpy(floatArray + i, &temp, sizeof(float)); // Copy bits into float
    }
}

void hexStringToLongArray(uint32_t *longArray, const char* hexString, unsigned int numLongs) {
    // This function translates a user-sent hexadecimal string into an array of floats, enabling the transmission
    // of arbitrary signals and parameters of a controller in a state space form.
    for (unsigned int  i = 0; i < numLongs; ++i) {
        uint32_t  temp;
        sscanf(hexString + i * 8, "%8x", &temp); // Read 8 hex digits (32 bits)
        memcpy(longArray + i, &temp, sizeof(uint32_t)); // Copy bits into float
    }
}


void hexStringToMatrix(float* matrix, const char* hexString, unsigned int order, unsigned int cols, unsigned int maxcols) {
    // This function translates a user-sent hexadecimal string into a matrix of floats, enabling the transmission
    // of arbitrary signals and parameters of a controller in a state space form.
    for (uint i = 0; i < order; ++i) {
        unsigned long temp;
        for (uint j = 0; j < cols; j++) {
            sscanf(hexString + (i*cols + j) * 8, "%8x", &temp); // Read 8 hex digits (32 bits)
            memcpy(matrix + (i*maxcols + j ), &temp, sizeof(float)); // Copy bits into float
        }
    }

}

String arrayToString(float * array, uint framesize){
    String arrayHex;
    for (uint i = 0; i < framesize; i++ ){
        arrayHex.concat(float2Hex(array[i]));
        if (i < framesize-1){
            arrayHex.concat(',');
        }
    }
    return arrayHex;
}

float linearInterpolation(uint32_t t[], float r[], uint16_t n, uint32_t t_interp) {
    uint16_t i;
    float result;
    float r1;

    for (i = 0; i < n - 1; i++) {
        if (t[i] <= t_interp && t_interp <= t[i + 1]) {
            // Linear interpolation formula: y = y1 + (y2 - y1) * ((x - x1) / (x2 - x1))
            r1 = (float) ( t_interp -  t[i]) / (t[i + 1] - t[i]);
            result = r[i] + (r[i + 1] - r[i]) *  r1;
        }
    }
    return result;
}

void voltsToMotor( float volts){
    // This function convert a voltage value given in variable volts
    // to a bipolar pwm signal for controlling the motor

    unsigned int pwm = abs(volts)*percent2pwm;

    if (volts < 0){
        // if var volts is negative use CH_PWM_AIN2 to output a pwm signal
        // proportional to the input voltage
        ledcWrite(PIN_AIN1, 0);
        ledcWrite(PIN_AIN2, pwm);
    }
    else{
        // if var volts is negative use CH_PWM_AIN1 to output a pwm signal
        // proportional to the input voltage
        ledcWrite(PIN_AIN1, pwm);
        ledcWrite(PIN_AIN2, 0);
    }
}


void sensorToColormap(float x, uint8_t * rgbval) {
    // This function calculates the R, G, and B values of a fifth-degree polynomial approximation of the turbo colormap.
    // It is the colormap displayed by the WS2812 LEDs connected to the thermal plant.
    // The resulting colormap enables the user to visualize both the plant's temperature and the controller's actions.
    // The input 'x' represents a normalized value within the [0, 1] range, corresponding to the analog variable visualized by the LEDs.
    // The input 'rgbval' is a 3-element array designed to store the computed RGB values.

    float r;
    float g;
    float b;
    // colormap turbo
    r = 0.1357 + x * ( 4.5974 - x * ( 42.3277 - x * ( 130.5887 - x * ( 150.5666 - x * 58.1375 ))));
    g = 0.0914 + x * ( 2.1856 + x * ( 4.8052 - x * ( 14.0195 - x * ( 4.2109 + x * 2.7747 ))));
    b = 0.1067 + x * ( 12.5925 - x * ( 60.1097 - x * ( 109.0745 - x * ( 88.5066 - x * 26.8183 ))));


    r = constrain(r,0,1);
    g = constrain(g,0,1);
    b = constrain(b,0,1);

    rgbval[0] = (uint8_t) 255*r;
    rgbval[1] = (uint8_t) 255*g;
    rgbval[2] = (uint8_t) 255*b;
    rgbval[0] = pgm_read_byte(&gamma8[rgbval[0]]);
    rgbval[1] = pgm_read_byte(&gamma8[rgbval[1]]);
    rgbval[2] = pgm_read_byte(&gamma8[rgbval[2]]);
}

