nebisman/UNDCMotor_julia/motor_firmware/esp32_unmotor/definitions.h
void displayLed(float var, float valmin, float valmax, float percent, uint8_t  led){
    // This function takes an analog variable and visualizes it as a colormap using the "sensorToColormap" function.
    // The 'var' parameter represents the analog variable, while 'valmin', 'valmax', and 'percent' serve as adjustment
    // parameters to scale the colormap.
    // The 'led' parameter, with values 0 or 1, denotes each of the LEDs attached to the plant.
    uint8_t rgb[3];
    float change;
    float x;
    float valmin_b;

    float valmax_b;
    float start = 0.025;
    change = valmax - valmin;
    valmin_b = valmin - percent * change;
    valmax_b = valmax + percent * change;
    x = start + constrain((1-start)* (var - valmin_b)/(valmax_b-valmin_b), 0, 1-start);
    sensorToColormap( x,  rgb);
    uint32_t color = dispLed.Color(rgb[0], rgb[1], rgb[2]);
    dispLed.setPixelColor(led, color );
    dispLed.setBrightness(40);
    dispLed.show();
}

void displayWhite() {
uint32_t color = dispLed.Color(255, 255,255);
dispLed.setPixelColor(0, color );
dispLed.setBrightness(20);
dispLed.show();
}



// This function suspend all  controlling tasks
void suspendAllTasks(){
    vTaskSuspend(h_publishStateTask);
    vTaskSuspend(h_generalControlTask);
    vTaskSuspend(h_controlPidTask);
    vTaskSuspend(h_speedControlPidTask);
    vTaskSuspend(h_speedGenControlTask);
    vTaskSuspend(h_identifyTask);
    vTaskSuspend(h_stepOpenTask);
    vTaskSuspend(h_buttonTask);
    voltsToMotor(0);
}


void resumeControl(){
      switch (typeControl) {
        case GENERAL_CONTROLLER_SPEED:
            vTaskResume(h_speedGenControlTask);
            break;
        case GENERAL_CONTROLLER_SPEED_2P:
            vTaskResume(h_speedGenControlTask);
            break;
        case PID_CONTROLLER:
            vTaskResume(h_controlPidTask);
            break;
        case PID_CONTROLLER_SPEED:
            vTaskResume(h_speedControlPidTask);
            break;
        case GENERAL_CONTROLLER:
            vTaskResume(h_generalControlTask);
            break;
        case GENERAL_CONTROLLER_2P:
            vTaskResume(h_generalControlTask);
            break;
    }
}

// This function activate the default controller
void defaultControl(){
    reference = DEFAULT_REFERENCE;
    vTaskSuspend(h_publishStateTask);
    codeTopic = DEFAULT_TOPIC;
    reset_int=true;
    resumeControl();
    vTaskSuspend(h_identifyTask);
    vTaskSuspend(h_stepOpenTask);
    vTaskResume(h_buttonTask);
}









void  onCommandReceived(char* lastTopic, byte* lastPayload) {
   
    JsonDocument doc;
    if (strstr(lastTopic, USER_SYS_SET_PID)) {
        deserializeJson(doc, lastPayload);
        kp = hex2Float((const char *) doc["kp"]);
        ki = hex2Float((const char *) doc["ki"]);
        kd = hex2Float((const char *) doc["kd"]);
        N = hex2Float((const char *) doc["N"]);
        beta = hex2Float((const char *) doc["beta"]);
        typeControl = hex2Long((const char *) doc["typeControl"]);
        beta = hex2Float((const char *) doc["beta"]);
        deadzone =  hex2Float((const char *) doc["deadzone"]);

        #ifdef DEBUG
        printf("PID parameters settled:\n    kp=%0.3f\n    ki=%0.3f\n    kd=%0.3f\n    N=%0.3f\n    Beta=%0.3f\n"
               "    Dead Zone=%0.3f\n", kp, ki, kd, N, beta, deadzone);
        printf("control code: %d\n", typeControl);
        #endif

        reset_int = true;
        defaultControl();
    }
    else if(strstr(lastTopic, USER_SYS_SET_GENCON)){
        deserializeJson(doc, lastPayload);
        order = hex2Long((const char *) doc["order"]);
        const char *hex_A = doc["A"];
        const char *hex_B = doc["B"];
        const char *hex_C = doc["C"];
        const char *hex_D = doc["D"];
        const char *hex_L = doc["L"];
        typeControl  = hex2Long((const char *) doc["typeControl"]);
        deadzone =  hex2Float((const char *) doc["deadzone"]);
        hexStringToMatrix( *A, hex_A, order, order, MAX_ORDER);
        hexStringToMatrix( *B, hex_B, order, 2, 2);
        hexStringToFloatArray(C, hex_C, order);
        hexStringToFloatArray(D, hex_D, 2);
        hexStringToFloatArray(L, hex_L, order);
        
        #ifdef DEBUG        
        printf("A general controller or order %d has been loaded\n", order);
        printf("A=\n");
        for ( uint8_t  i =0; i < order; i++ ){
            for (size_t j =0; j < order; j++ ) {
                printf("%0.4f    ", A[i][j]);
            }
            printf("\n");
        }
        printf("B=\n");
        for (uint8_t  i =0; i < order; i++ ) {
            for (size_t j =0; j < 2; j++ ) {
                printf("%0.4f    ", B[i][j]);
            }
            printf("\n");
        }
        printf("C=\n");
        for (uint8_t  j =0; j < order; j++ ) {
            printf("%0.4f    ", C[j]);
        }
        printf("\n");
        printf("D = %0.4f   %0.4f \n", D[0], D[1]);
        printf("L=\n");
        for (uint8_t  j =0; j < order; j++ ) {
            printf("%0.4f    ", L[j]);
        }
        printf("\n");
        printf("control code: %d\n", typeControl);
        #endif
        reset_int = true;
        defaultControl();
    }

    else if (strstr(lastTopic, USER_SYS_SET_REF)) {
        deserializeJson(doc, lastPayload);
        reference = hex2Float((const char *) doc["reference"]);
        #if DEBUG
        printf("Reference has been set to %0.2f degrees \n", reference);
        #endif
        reset_int = true;
        defaultControl();
    }
    else if (strstr(lastTopic, USER_SYS_STEP_CLOSED )) {
        codeTopic = USER_SYS_STEP_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        points_high = hex2Long((const char *) doc["points_high"]);
        points_low = hex2Long((const char *) doc["points_low"]);
        total_time = points_low + points_high;
        
        #ifdef DEBUG
        printf("Closed loop step response:\n");
        printf("    low value=%0.2f\n    high value=%0.2f\n    time in high =%0.2f\n    time in low=%0.2f\n", low_val,
               high_val, (float) (points_high * h), (float) (points_low * h));
        #endif

        vTaskResume(h_publishStateTask);
        reset_int = true;
        resumeControl();
    }
    else if (strstr(lastTopic, USER_SYS_STAIRS_CLOSED)){
        codeTopic = USER_SYS_STAIRS_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["min_val"]);
        high_val = hex2Float((const char *) doc["max_val"]);
        points_stairs = hex2Long((const char *) doc["points_stairs"]);
        duration = hex2Long((const char *) doc["duration"]);
        const char *hexSignal = doc["signal"];
        hexStringToFloatArray(stairs, hexSignal, points_stairs);
        total_time = points_stairs * duration - 1;

        #ifdef DEBUG
        printf("Stairs signal of %d steps  with a duration of %0.2f secs.\n", points_stairs, h * total_time);
        #endif  
             
        vTaskResume(h_publishStateTask);
        reset_int = true;
        resumeControl();
    }

    else if(strstr(lastTopic, USER_SYS_PRBS_OPEN )) {
        codeTopic = USER_SYS_PRBS_OPEN_INT;
        deserializeJson(doc, lastPayload);
        low_val  = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        divider = hex2Long((const char *) doc["divider"]);
        total_time = PRBS_LENGTH * divider;

        #ifdef DEBUG
        printf("Open loop test with a prbs signal with %d steps with a duration of %0.2f secs.\n",
               total_time, (total_time-1) * h);
        #endif
        
        vTaskResume(h_publishStateTask);
        reset_int = true;
        vTaskResume(h_identifyTask);
    }
    else if(strstr(lastTopic, USER_SYS_STEP_OPEN )){
        codeTopic = USER_SYS_STEP_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        points_high = hex2Long((const char *) doc["points_high"]);
        points_low = hex2Long((const char *) doc["points_low"]);
        total_time = points_low + points_high;
        
        #ifdef DEBUG
        printf("Open loop step response:\n");
        printf("    low value=%0.2f\n    high value=%0.2f\n    time in high=%0.2f\n    time in low=%0.2f\n", low_val,
               high_val, (float) (points_high * h), (float) (points_low * h));
        #endif
        
        vTaskResume(h_publishStateTask);
        reset_int = true;
        vTaskResume(h_stepOpenTask);
    }

    else if(strstr(lastTopic, USER_SYS_PROFILE_CLOSED)){
        codeTopic = USER_SYS_PROFILE_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        points_stairs = hex2Long((const char *) doc["points"]);
        low_val = hex2Float((const char *) doc["min_val"]);
        high_val = hex2Float((const char *) doc["max_val"]);
        const char *timeValuesHex = doc["timevalues"];
        const char *stairsHex = doc["refvalues"];
        hexStringToFloatArray(stairs, stairsHex, points_stairs);
        hexStringToLongArray(timeValues, timeValuesHex, points_stairs);
        total_time = timeValues[points_stairs - 1];
        
        #ifdef DEBUG
            printf("Closed loop profile response with a duration of %0.2f secs.\n", total_time * h);
            printf("   refvalues = [ ");
            for (uint8_t  j =0; j < points_stairs; j++ ) {
                printf("%0.2f ", stairs[j]);
            }
            printf("]\n");
            printf("   timevalues = [ ");
            for (uint8_t  j =0; j < points_stairs; j++ ) {
                printf("%0.2f ", timeValues[j] * h);
            }
            printf("]\n");
        #endif

        vTaskResume(h_publishStateTask);
        reset_int = true;
        resumeControl();
    }
}


