nebisman/UNDCMotor_julia/motor_firmware/esp32_unmotor/definitions.h
/* ---------------------------------------------------------------
 * onSerialReceive  (UART ISR / receive callback)
 * Called by the ESP32 Arduino UART driver whenever new bytes land
 * in the hardware RX FIFO.  It simply wakes serialCommandTask via a
 * direct-to-task notification so no CPU time is spent polling.
 * --------------------------------------------------------------- */
static void onSerialReceive() {
    suspendAllTasks();
    xTaskNotifyGive(h_serialCommandTask);
}

/* ---------------------------------------------------------------
 * serialCommandTask
 * Blocks indefinitely (no polling) until onSerialReceive wakes it.
 * Then reads the two-line command and calls onMqttReceived unchanged.
 *
 * Protocol (two lines, '\n'-terminated):
 *   Line 1 – topic string, e.g.  /motor/user/motor_1/set_pid
 *   Line 2 – JSON payload,  e.g. {"kp":"3f800000","ki":"00000000",...}
 * --------------------------------------------------------------- */
static void serialCommandTask(void *pvParameters) {
    static char topicBuf[128];
    static char payloadBuf[2048];

    // Register the ISR callback now that the task handle is valid   

    for (;;) {
        // Block with no timeout until the ISR gives a notification
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

        // Read topic line
        size_t topicLen = Serial.readBytesUntil('\n', topicBuf, sizeof(topicBuf) - 1);
        topicBuf[topicLen] = '\0';
        // Strip trailing '\r' if present (Windows line endings)
        if (topicLen > 0 && topicBuf[topicLen - 1] == '\r') {
            topicBuf[--topicLen] = '\0';
        }

        // Read payload line (already in the RX buffer — no extra delay needed)
        size_t payloadLen = Serial.readBytesUntil('\n', payloadBuf, sizeof(payloadBuf) - 1);
        payloadBuf[payloadLen] = '\0';
        if (payloadLen > 0 && payloadBuf[payloadLen - 1] == '\r') {
            payloadBuf[--payloadLen] = '\0';
        }

        if (topicLen > 0 && payloadLen > 0) {
            #ifdef DEBUG
               printf("[Serial] topic:   %s\n", topicBuf);
               printf("[Serial] payload: %s\n", payloadBuf);
            #endif

            // Reuse the existing handler without any modification to its body
            onCommandReceived(topicBuf, (byte*) payloadBuf);
        }
    }
}





void publishStateClosed(uint indexFrame, uint currFrame) {
    JsonDocument doc;
    char jsonBuffer[BUFFER_SIZE * 32];
    doc["r"] = arrayToString(rBuffer, indexFrame + 1);
    doc["u"] = arrayToString(uBuffer, indexFrame + 1);
    doc["y"] = arrayToString(yBuffer, indexFrame + 1);
    doc["frame"] = long2Hex(currFrame);
    serializeJson(doc, jsonBuffer);     
    Serial.println(jsonBuffer);
}

void publishStateOpen(uint indexFrame, uint currFrame) {
    JsonDocument doc;
    char jsonBuffer[BUFFER_SIZE * 24];
    doc["u"] = arrayToString(uBuffer, indexFrame+1);
    doc["y"] = arrayToString(yBuffer, indexFrame+1);
    doc["frame"] = long2Hex(currFrame);
    serializeJson(doc, jsonBuffer); 
    //Serial.print("D:");
    Serial.println(jsonBuffer);

}

static void publishStateTask (void *pvParameters) {
    // local constants
    uint32_t rv;
    uint16_t  indexFrame;
    uint16_t currFrame;

    for (;;) {
        xTaskNotifyWait(0, 0b0011, &rv, portMAX_DELAY);
        if (rv & 0b0001) {
            if (np <= total_time) {
                indexFrame = np % BUFFER_SIZE;
                currFrame = np/BUFFER_SIZE + 1;
                rBuffer[indexFrame] = reference;
                uBuffer[indexFrame] = usat;
                yBuffer[indexFrame] = y;
                if (indexFrame == BUFFER_SIZE - 1) {
                    publishStateClosed(indexFrame, currFrame);
                  }
                else if (np == total_time) {
                    publishStateClosed(indexFrame, currFrame);
                  }

            }
        }
        else if  ( rv & 0b0010 ){
            if (np <= total_time) {
                indexFrame = np % BUFFER_SIZE;
                currFrame = np / BUFFER_SIZE + 1;
                uBuffer[indexFrame] = u;
                yBuffer[indexFrame] = y;
                if (indexFrame == BUFFER_SIZE - 1) {
                    publishStateOpen(indexFrame, currFrame);
                }
                else if (np == total_time) {
                    publishStateOpen(indexFrame, currFrame);
                }

            }

        }

    }
}


float compDeadZone(float var, float dz){
    // This function compensates the dead zone of DC motor
    if (var == 0){
        return 0;
    }
    else {
        float sgnvar = abs(var)/var;
        return var + sgnvar * dz ;
    }

}

void setup_peripherals(void){
    //setting the pwm channels
    
    ledcAttach(PIN_AIN1, FREQUENCY_PWM, RESOLUTION_PWM);
    ledcAttach(PIN_AIN2, FREQUENCY_PWM, RESOLUTION_PWM);

    //open the serial port for revising the board messages
    

    //setting the encoders
    encoderMotor.attachFullQuad (CH_ENC_A, CH_ENC_B);
    encoderMotor.setCount(0);


   // Setting the potentiometer for setting reference

    pinMode( CH_ENC_A_POT, INPUT_PULLUP);
    pinMode( CH_ENC_B_POT, INPUT_PULLUP);
    pinMode(DRIVER_ON, OUTPUT);
    digitalWrite(DRIVER_ON, HIGH);
    encoderPot.attachFullQuad(CH_ENC_A_POT, CH_ENC_B_POT);
    encoderPot.clearCount();
    encoderPot.setFilter(1023);

   // setting rgb led
    dispLed.begin();
    dispLed.clear();
    dispLed.show();
    dispLed.setBrightness(30);

    // Setting serial port for receiving commands from the user through USB
    Serial.begin(BAUDRATE);
     Serial.onReceive(onSerialReceive);

    // Create the task for receiving commands through USB 

    }
